app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
    def index
        dogs = Dog.all

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      dog = Dog.find(params[:id])